public class _01_煤球数目 {
	// 题意：
	// 1----------*
	// 2--------* * *
	// 3-----* * * * * *
	// 4-* * * * * * * * * *
	// 注意求的是100层总共的值,不是第100层的值

	// 规律:
	//
	// *-------------------------- (0)+1
	// * * *---------------------- (0 + 1) + 2
	// * * * * * *---------------- ((0 + 1) + 2) + 3
	// * * * * * * * * * *-------- (((0 + 1) + 2) + 3) + 4
	public static void main(String[] args) {
		Long sum = 0l;
		Long k = 0l;
		for (Long i = 1l; i <= 100; i++) {
			k += i;
			sum += k;
		}
		System.out.println(sum);
		//结果： 171700
	}
}