package 蓝桥杯历年真题刷题笔记._2015_java_B_;

public class _06_加法变乘法 {
	public static void main(String[] args) {
		// 1+2+3+4+5....+49 一共有49个数
		// i表示第一个乘号出现在第i个数之后的位置,j表示第二个乘号出现在第j个数之后的位置
		// 1+2+3+4+5...46*47+48*49 j最多可以出现在48之后的位置，i最多可以出现在46之后的位置

		int sum = (1 + 49) * 49 / 2;// 先将1+2+3+..+49求和
		int k = 0;
		for (int i = 1; i <= 46; i++) {
			for (int j = i + 2; j <= 48; j++) {
				// 将i+(i+1) 替换为 i*(i+1)
				// 将j+(j+1) 替换为 j*(j+1)
				k = sum - (i + i + 1) - (j + j + 1);
				k += i * (i + 1) + j * (j + 1);
				if (k == 2015) {
					System.out.println(i + " " + j);
				}
			}
		}
		/*
		 * 输出
		 * 10 27
		 * 16 24
		 */
	}
}
