public class _02_生日蜡烛 {
	public static void main(String[] args) {
		// 解法2：
		// 等差数列求和公式 == (首项+末项)*项数÷2
		// 因为： 末项 = 首项+(项数-1)*公差
		// 所以：(首项+首项+(项数-1)*公差)*项数÷2
		// 所以：== ( a_0 + a_0 + (n-1) * d ) * n / 2
		// 因为：d==1
		// 所以：== ( a_0 + a_0 + (n-1) ) * n / 2
		// 所以：== ( 2*a_0 + (n-1) ) * n / 2
		// 因为：sum==236
		// 所以：236 == ( 2*a_0 + (n-1) ) * n / 2
		// 所以：236*2/n-(n-1) == 2 * a_0
		// 设 k == 236*2/n-(n-1)
		// 因为 a_0 是整数，
		// 所以 k%2 == 0
		// 所以：a_0 == k/2
		for (double n = 1; n < 100; n++) {
			double k = 236 * 2.0 / n - (n - 1);
			if (k % 2.0 == 0) {
				double a_0 = k / 2;
				System.out.println(a_0);
			}
		}
	}
}
